app/Controllers/AdminController.php

    public function eliminarDirectivo($idusuario)
    {
        $usuarioModel = new Usuario();

        $usuario = $usuarioModel->find($idusuario);
        if ($usuario && $usuario['idrol'] === '2') {
            if (!$usuarioModel->delete($idusuario)) {
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`idusuario` = '196'
DELETE FROM `usuarios`
WHERE `idusuario` IN ('196')

    public function registrar_dispositivo()
    {
        $session = session();
        $idusuario = $session->get('idusuario');

        if (!$idusuario) {
            return redirect()->to('/login')->with('error', 'Sesión no iniciada.');
        }

        $usuarioModel = new Usuario();
        $usuario = $usuarioModel->find($idusuario);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`idusuario` = '187'