app/Controllers/AdminController.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`idusuario` = '177'
---
    public function editarDirectivo($idusuario)
    {
        $usuarioModel = new Usuario();
        $usuario = $usuarioModel->find($idusuario);

SELECT *
FROM `dispositivo`
WHERE `mac` = 'B0:A7:32:D7:49:30'
 LIMIT 1
---
public function guardar_dispositivo() {
    $mac = $this->request->getPost('mac');
    $idusuario = session()->get('idusuario');
    $idcolegio = session()->get('idcolegio');

    if (!preg_match('/^([0-9A-Fa-f]{2}:){5}[0-9A-Fa-f]{2}$/', $mac)) {
        return redirect()->back()->with('error', 'La dirección MAC no tiene un formato válido.');
    }

    $dispositivoModel = new \App\Models\DispositivoModel();

    // Verificar si la MAC existe en la base de datos
    $dispositivoExistente = $dispositivoModel
        ->where('mac', $mac)
        ->first();