app/Controllers/AdminController.php

public function index()
{
    if (session()->get('idrol') !== '1') {
        return redirect()->to('/login');
    }

    $idcolegio = session()->get('idcolegio');
    $db = \Config\Database::connect();

    // Directivos
    $queryDirectivos = $db->table('usuario_colegio uc')
        ->select('u.idusuario, u.usuario, u.email')
        ->join('usuarios u', 'u.idusuario = uc.idusuario')
        ->where('uc.idcolegio', $idcolegio)
        ->where('uc.idrol', 2)
        ->orderBy('u.usuario', 'ASC')
        ->get();

    $usuarios_directivos = $queryDirectivos->getResultArray();

    // Profesores
    $queryProfesores = $db->table('usuario_colegio uc')
        ->select('u.idusuario, u.usuario, u.email')
        ->join('usuarios u', 'u.idusuario = uc.idusuario')
        ->where('uc.idcolegio', $idcolegio)
        ->where('uc.idrol', 4)
        ->orderBy('u.usuario', 'ASC')
        ->get();
---
SELECT `u`.`idusuario`, `u`.`usuario`, `u`.`email`
FROM `usuario_colegio` `uc`
JOIN `usuarios` `u` ON `u`.`idusuario` = `uc`.`idusuario`
WHERE `uc`.`idcolegio` = '3'
AND `uc`.`idrol` = 2
ORDER BY `u`.`usuario` ASC
SELECT *
FROM `usuarios`
WHERE `idrol` = '3'
AND `idcolegio` = '4'
ORDER BY `usuario` ASC
SELECT `u`.`idusuario`, `u`.`usuario`, `u`.`email`
FROM `usuario_colegio` `uc`
JOIN `usuarios` `u` ON `u`.`idusuario` = `uc`.`idusuario`
WHERE `uc`.`idcolegio` = '3'
AND `uc`.`idrol` = 4
ORDER BY `u`.`usuario` ASC

public function registrar_dispositivo()
{
    $session = session();
    $idusuario = $session->get('idusuario');
    $idcolegio = $session->get('idcolegio');

    if (!$idusuario) {
        return redirect()->to('/login')->with('error', 'Sesión no iniciada.');
    }

    $dispositivoModel = new DispositivoModel();
    $usuarioColegioModel = new \App\Models\UsuarioColegioModel();

    // Dispositivos ya registrados
    $mis_dispositivos = $dispositivoModel->getDispositivosConColegio($idusuario);

    // Obtener la cantidad total comprada desde usuario_colegio
    $usuarioColegio = $usuarioColegioModel
        ->where('idusuario', $idusuario)
        ->where('idcolegio', $idcolegio)
        ->first();
---
SELECT *
FROM `usuario_colegio`
WHERE `idusuario` = '239'
AND `idcolegio` = '27'
 LIMIT 1

public function editarProfesor($idusuario)
{
    $usuarioModel = new \App\Models\Usuario();
    $usuario = $usuarioModel->find($idusuario);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`idusuario` = '177'

public function solicitudesPendientes()
{
    $session = \Config\Services::session();
    $usuarioColegioModel = new \App\Models\UsuarioColegioModel();
    $solicitudModel = new \App\Models\SolicitudAdminModel();
    $usuarioModel = new \App\Models\Usuario();

    $idusuario = session()->get('idusuario');

    // Obtener colegio donde el usuario es admin
    $adminColegio = $usuarioColegioModel
        ->where('idusuario', $idusuario)
        ->where('idrol', 1)
        ->first();

    if(!$adminColegio){
        return redirect()->to('/admin')->with('error', 'No eres admin de ninguna institución.');
    }

    $idcolegio = $adminColegio['idcolegio'];

    // Obtener solicitudes pendientes
    $solicitudes = $solicitudModel->obtenerPendientesPorColegio($idcolegio);

    // Adjuntar datos del usuario que realizó la solicitud
    foreach($solicitudes as &$sol){
        $usr = $usuarioModel->find($sol['idusuario']);
---
SELECT *
FROM `usuario_colegio`
WHERE `idusuario` = '239'
AND `idrol` = 1
 LIMIT 1
SELECT *
FROM `usuarios`
WHERE `usuarios`.`idusuario` = '239'