app/Controllers/Auth.php

SELECT *
FROM `usuarios`
WHERE `email` = 'juanmarquez@alumnos.itr3.edu.ar'
 LIMIT 1
SELECT `uc`.`idcolegio`, `uc`.`idrol`, `c`.`nombre` as `colegio`, `r`.`tipo` as `rol`
FROM `usuario_colegio` `uc`
JOIN `colegios` `c` ON `c`.`idcolegio` = `uc`.`idcolegio`
JOIN `rol` `r` ON `r`.`idrol` = `uc`.`idrol`
WHERE `uc`.`idusuario` = '177'
---
    public function autenticar()
    {
        $session = session();
        $Usuario = new Usuario();

        $email = strtolower(trim($this->request->getPost('email')));
        $contrasenia = $this->request->getPost('password');

        $user = $Usuario->where('email', $email)->first();

        if (!$user || !password_verify($contrasenia, $user['password'])) {
            session()->setFlashdata('error', 'Alguno de los datos ingresados no es correcto.');
            return redirect()->to('/login');
        }

        // Guardar sesión básica sin contexto aún
        $session->set([
            'idusuario' => $user['idusuario'],
            'username'  => $user['usuario'],
            'email'     => $user['email'],
            'logged_in' => true
        ]);

        // Buscar colegios y roles del usuario
        $db = \Config\Database::connect();
        $builder = $db->table('usuario_colegio uc');
        $builder->select('uc.idcolegio, uc.idrol, c.nombre as colegio, r.tipo as rol');
        $builder->join('colegios c', 'c.idcolegio = uc.idcolegio');
        $builder->join('rol r', 'r.idrol = uc.idrol');
        $builder->where('uc.idusuario', $user['idusuario']);
        $result = $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `cursos`
WHERE `idcolegio` = '27'
---
    private function redirigirPorRol($idrol)
    {
        if ($idrol == 1) { // Admin
            $cursoModel = new \App\Models\CursoModel();
            $idcolegio = session()->get('idcolegio');

            $hayCursos = $cursoModel->where('idcolegio', $idcolegio)->countAllResults();

SELECT `uc`.`idcolegio`, `uc`.`idrol`, `c`.`nombre` as `colegio`, `r`.`tipo` as `rol`
FROM `usuario_colegio` `uc`
JOIN `colegios` `c` ON `c`.`idcolegio` = `uc`.`idcolegio`
JOIN `rol` `r` ON `r`.`idrol` = `uc`.`idrol`
WHERE `uc`.`idusuario` = '177'
---
public function mostrarOpcionesCambio()
{
    $session = session();
    if (!$session->has('idusuario')) {
        return redirect()->to('/login'); // seguridad
    }

    $idusuario = $session->get('idusuario');

    $db = \Config\Database::connect();
    $builder = $db->table('usuario_colegio uc');
    $builder->select('uc.idcolegio, uc.idrol, c.nombre as colegio, r.tipo as rol');
    $builder->join('colegios c', 'c.idcolegio = uc.idcolegio');
    $builder->join('rol r', 'r.idrol = uc.idrol');
    $builder->where('uc.idusuario', $idusuario);
    $result = $builder->get()->getResultArray();