app/Controllers/Auth.php

    public function autenticar()
{
    $session = session();
    $Usuario = new Usuario();

    $username = $this->request->getPost('usuario');
    $contrasenia = $this->request->getPost('password');
    $colegioSeleccionado = $this->request->getPost('idcolegio');

    $user = $Usuario->where('usuario', $username)
                    ->where('idcolegio', $colegioSeleccionado)
                    ->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'juan marquez'
AND `idcolegio` = '13'
 LIMIT 1