app/Controllers/AvisosController.php

SELECT *
FROM `cursos`
WHERE `idcolegio` = '3'
---
    public function crearAviso()
    {
        $session = session();
        $idcolegio = $session->get('idcolegio');

        // Traer cursos del colegio
        $cursos = $this->db->table('cursos')
            ->where('idcolegio', $idcolegio)
            ->get()
            ->getResult();