app/Controllers/DirectivoController.php

SELECT `u`.`idusuario`, `u`.`usuario`, `u`.`email`
FROM `usuario_colegio` `uc`
JOIN `usuarios` `u` ON `u`.`idusuario` = `uc`.`idusuario`
WHERE `uc`.`idcolegio` = '1'
AND `uc`.`idrol` = 3
ORDER BY `u`.`usuario` ASC
---
    public function gestionarUsuarios()
    {
        $idcolegio = session()->get('idcolegio');

        $db = \Config\Database::connect();

        $lectores = $db->table('usuario_colegio uc')
            ->select('u.idusuario, u.usuario, u.email')
            ->join('usuarios u', 'u.idusuario = uc.idusuario')
            ->where('uc.idcolegio', $idcolegio)
            ->where('uc.idrol', 3)
            ->orderBy('u.usuario', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `usuarios`
WHERE `usuarios`.`idusuario` = '177'
---
public function editarUsuario($idusuario)
{
    $usuario = $this->Usuario->find($idusuario);