app/Controllers/Horarios.php

SELECT *
FROM `excepciones`
WHERE `idcolegio` = '27'
AND `fecha` = '2025-12-05'
---
    $anio       = date('Y');

    // 1️⃣ Verificar excepciones manuales
    $excepcion = $db->table('excepciones')
                    ->where('idcolegio', $idcolegio)
                    ->where('fecha', $fechaHoy)
                    ->get()
                    ->getRow();

SELECT *
FROM `eventos_especiales`
WHERE `idcolegio` = '27'
AND `fecha` = '2025-12-05'
AND `hora` = '15:05:00'
AND `activo` = 1
---
    }

    // 3️⃣ Verificar eventos especiales
    $evento = $db->table('eventos_especiales')
                 ->where('idcolegio', $idcolegio)
                 ->where('fecha', $fechaHoy)
                 ->where('hora', $horaActual)
                 ->where('activo', 1)
                 ->get()
                 ->getRow();

SELECT *
FROM `horarios`
WHERE `idcolegio` = '27'
AND `hora` = '15:05:00'
AND `iddia` = '5'
---
    }

    // 4️⃣ Verificar horarios normales
    $horario = $db->table('horarios')
                  ->where('idcolegio', $idcolegio)
                  ->where('hora', $horaActual)
                  ->where('iddia', $diaSemana)
                  ->get()
                  ->getRow();