app/Controllers/Horarios.php

    public function checkTime() {
        $horaActual = $this->request->getVar('hora');
        $mac = $this->request->getVar('mac');

        error_log("Hora recibida: " . $horaActual);
        error_log("MAC recibida: " . $mac);

        $db = \Config\Database::connect();

        // Buscar el dispositivo por MAC
        $builderDispositivo = $db->table('dispositivo');
        $builderDispositivo->where('mac', $mac);
        $dispositivo = $builderDispositivo->get()->getRow();

        if (!$dispositivo) {
            error_log("Dispositivo con MAC no encontrado");
            return $this->response->setBody("no");
        }

        $idcolegio = $dispositivo->idcolegio;

        // Buscar horarios coincidentes para ese colegio
        $builderHorarios = $db->table('horarios');
        $builderHorarios->where('hora', $horaActual);
        $builderHorarios->where('idcolegio', $idcolegio);
        $horarios = $builderHorarios->get()->getResult();
---
SELECT *
FROM `dispositivo`
WHERE `mac` = 'B0:A7:32:D7:49:34'
SELECT *
FROM `horarios`
WHERE `hora` = '14:11:0'
AND `idcolegio` = '3'