app/Controllers/Horarios.php

SELECT *
FROM `horarios`
WHERE `idcolegio` = '1'
UPDATE `eventos_especiales` SET `activo` = 0
WHERE `fecha` < '2025-08-22'
SELECT *
FROM `eventos_especiales`
WHERE `idcolegio` = '1'
AND `activo` = 1
ORDER BY `fecha` ASC
---
    public function index()
{
    $session = session();
    $idcolegio = $session->get('idcolegio'); // Obtenemos el colegio del usuario

    // 1️⃣ Verificar si hay dispositivos asociados al colegio
    $dispositivoModel = new \App\Models\DispositivoModel();
    $dispositivos = $dispositivoModel->where('idcolegio', $idcolegio)
                                     ->where('estado', 1) // opcional, solo activos
                                     ->findAll();

    $tieneDispositivos = !empty($dispositivos);

    // 2️⃣ Traer horarios regulares
    $modelHorarios = new \App\Models\HorariosModel();
    $data = $modelHorarios->where('idcolegio', $idcolegio)->findAll();

    // 3️⃣ Traer eventos especiales activos
    $modelEventos = new \App\Models\EventosEspecialesModel();
    $hoy = date('Y-m-d');
    $modelEventos->where('fecha <', $hoy)->set(['activo' => 0])->update();

    $eventosEspeciales = $modelEventos
                         ->where('idcolegio', $idcolegio)
                         ->where('activo', 1)
                         ->orderBy('fecha', 'ASC')
                         ->findAll();