app/Controllers/ProfesorController.php

    public function avisos()
    {
        $idusuario = $this->session->get('idusuario');
        $idcolegio = $this->session->get('idcolegio');

         if (!$idusuario || !$idcolegio) {
        return redirect()->to(base_url('login'));
    }

        // Traer cursos del profesor si existe la tabla profesor_curso
        $cursosProfesor = $this->db->table('profesor_curso')
            ->select('idcurso')
            ->where('idusuario', $idusuario)
            ->get()
            ->getResultArray();
---
SELECT `idcurso`
FROM `profesor_curso`
WHERE `idusuario` = '177'