app/Models/DispositivoModel.php

SELECT `dispositivo`.*
FROM `dispositivo`
JOIN `usuarios` ON `usuarios`.`idusuario` = `dispositivo`.`idusuario`
WHERE `usuarios`.`usuario` = 'juan marquez'
---
    public function getDispositivosUsuario($nombreUsuario)
{
    return $this->select('dispositivo.*')
                ->join('usuarios', 'usuarios.idusuario = dispositivo.idusuario')
                ->where('usuarios.usuario', $nombreUsuario)
                ->findAll();