app/Views/horarios_lector.php

    $session = session();
    $idcolegio = $session->get('idcolegio');
    $db = \Config\Database::connect();
    $dispositivo = $db->table('dispositivo')->where('idcolegio', $idcolegio)->get()->getRow();
---
SELECT *
FROM `dispositivo`
WHERE `idcolegio` = '3'